In [2]:
#Data Cleaning and Preprocessing using Pandas

import pandas as pd


sales = pd.Series([2,None,5])

sales

0    2.0
1    NaN
2    5.0
dtype: float64

In [3]:
sales.dropna()

0    2.0
2    5.0
dtype: float64

In [4]:
# fill it with a number like 5
sales.fillna(5)

0    2.0
1    5.0
2    5.0
dtype: float64

In [ ]:
#aggregation :substitute the nan with mean

sales.fillna(sales.mean())  #best work than use the min or max

0    2.0
1    3.5
2    5.0
dtype: float64

In [6]:
# fill the na with the std

sales.fillna(sales.std())

0    2.00000
1    2.12132
2    5.00000
dtype: float64

In [7]:
sales.fillna(sales.var())

0    2.0
1    4.5
2    5.0
dtype: float64

In [13]:
# to removes the duplicated entries

name = ['Aayush','Aayush',"Gopal Ji",]
contact= ['123','123',"555",]

data = pd.DataFrame({'Name':name, 'Contact':contact})

data

       Name Contact
0    Aayush     123
1    Aayush     123
2  Gopal Ji     555

In [ ]:
#to remove the duplicates in above. One entry will be kept and other will be removed

data.drop_duplicates() #kept the one with the smaller id.

       Name Contact
0    Aayush     123
2  Gopal Ji     555

In [18]:
# Replace the values in the data

# replace 123 with 555

data.replace('123',"555",inplace=True) #made it permanent

data

       Name Contact
0    Aayush     555
1    Aayush     555
2  Gopal Ji     555

In [20]:
data['Contact'] =data['Contact'].astype(float)

data

       Name  Contact
0    Aayush    555.0
1    Aayush    555.0
2  Gopal Ji    555.0

In [23]:
data['preferences'] =['yes','no','or']
data['preferences'].str.upper()

0    YES
1     NO
2     OR
Name: preferences, dtype: object